HELYXcore-4.4.0/examples/legacy/multiphase/interDyMFoam/laminar/damBreakWithObstacle/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 5e-07;

boundaryField
{
    atmosphere
    {
        type            zeroGradient;
    }

    walls
    {
        type            nutkRoughWallFunction;
        roughnessHeight 100e-6;
        roughnessConstant 0.5;
        value           $internalField;
    }
}


// ************************************************************************* //
